/*var i = 1;
while(i<=30) {
  console.log(i);
  i+=2;
}*/


// var i = 30;
// while(i>=2) {
//   console.log(i);
//   i-=2;
// }


// var arr = [1, 2, 115, 4, 58, 5 ,7 ,99];
// for (var i = 0; i < arr.length; i++) {
// if (arr[i] == 4) 
// console.log('Есть!');

// }


// Имеется массив с элементами 1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20;
// Нужно найти перебирая эти элементы с помощью цикла четные числа.
// И эти найденные четные числа должны быть собраны в одном массиве.

/*var x = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20];
var i = 0;
var arr = [];
for ( var y = 0; y <=x.length; y++) {
  if (x[y] % 2 ==0) {arr[i]=x[y]
i =i+1;
  }
  
}
console.log(arr);*/




/*var x = [1, 55, 89, 48, 66, 59, 101, 548, 10, 620 ,777, 540];
var i = 0;
for ( var i = 0; i <=x.length; i++) {
  if (arr[i] % 2 ==0) {
  
x += arr[i;] 
  }
  
}
console.log(x);*/






let arr = [1, 55, 89, 48, 66, 59, 101, 548, 10, 620 ,777, 540] 
        let sum = 0;
        for (let i=0; i < arr.length; i++){
            if (arr[i] % 2 == 0){
                sum += arr[i];
            }
        }

        console.log(sum);